docs/phys360/KBhPHYS360RotationalKineticEnergy.tex
% Created 2021-09-11 Sat 09:36
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Houjun Liu}
\date{\today}
\title{Rotational Kinetic Energy}
\hypersetup{
 pdfauthor={Houjun Liu},
 pdftitle={Rotational Kinetic Energy},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{A review of what happened before}
\label{sec:org39e75cf}

\begin{align}
PE &= mg \Delta h \\
KE &= \frac{1}{2} mv^2
\end{align}

\section{Rotational Kinetic Energy}
\label{sec:org4c918f2}
But, really, the definition of kinetic energy is a bit of a lie. Because really, its actually the following thing:

\begin{equation}
KE_{total} = KE_{translational} + KE_{rotational}
\end{equation}

Where, \(KE_{rotational} = \frac{1}{2}MV^2\) we already know. That's the movement of CM. But, there is another energy if the object spins:

\begin{equation}
KE_{rotational} = \frac{1}{2}I\omega^2
\end{equation}

Where, \(I\) is the moment of inertia ("spinny mass") around the axis of rotation, and \(\omega\) the angular velocity ("spinny velocity").

You could see, the same equation just happens twice, but the variables are different for the rotational case.


\subsection{Axis of Rotation}
\label{sec:org2639a4e}
A line through the center of mass such that the rest of the mass of the object are going in circular motion around that axis. Yes, if the object is tubing, it will just rapidly change.

\subsection{Angular Velocity}
\label{sec:orgbb53ebe}
Its the speed at which its rotating. So:

\begin{equation}
||\vec{\omega}|| = \frac{d\theta}{dt}
\end{equation}

But, its a vector! So there is an actual "direction" of rotation. If you have an object that's rotating and an axis for that rotation, take your fingers to the direction by which the object is rotating, your thumb is point at the direction of rotation and hence you could assign a sign.

\subsection{Deriving the Value of Kinetic Energy}
\label{sec:org7d485ef}
\href{KBhPHYS360RotationalKineticEnergyDerivation.org}{See here.}

In summary,

\begin{equation}
     KE_{total} = \frac{1}{2} M \vec{V_{CM}}^2 + \sum^N_{i=1} \frac{1}{2}m_i\vec{v_i}'^2
\end{equation}


\section{Actually using Rotational Kinetic Energy}
\label{sec:org5a1c748}
This:

\begin{equation}
    \vec{v} = r_i \times w
\end{equation}

But um. He won't tell us. Also, defining center of mass:

\begin{equation}
CM \equiv \frac{1}{M} \sum m_i \vec{r_i}
\end{equation}


To fully define rotation, we need to know both the \emph{axis} around which it is rotating. The act of rotation, at an instant, will be around a specific axis "always".

Given \(m_i\), mass, \(\vec{r_i}'\), location of the center of mass, \(l_i\), \(\omega\), the angular velocity, figure a \(KE_{tot,rot}\). 

Because of the fact that the value \(\omega\) is in units \(\frac{d\theta}{dt}\), the rate of radians change, and we know of a radius of the spin \(l_i\), we could figure the velocity at which it is moving by simply scaling the change in radians up to a circle of radius \(l_i\), that is:

\begin{equation}
    V_i' = l_i \omega 
\end{equation}

(note that, to understand this, radians \(\frac{arc length}{radius}\))

And so, substituting into the statement of \(\sum^N_{i=1} \frac{1}{2}m_i\vec{v_i}'^2\)

\begin{align}
    KE_{rot} =& \sum^N_{i=1} \frac{1}{2}m_i\vec{v_i}'^2 \\
    =& \sum^N_{i=1} \frac{1}{2}m_i(l_i \omega)^2 \\
    =& \sum^N_{i=1} \frac{1}{2}m_i l_i^2 \omega^2 \\
    =& \frac{1}{2}\omega^2 \sum^N_{i=1} (m_i l_i^2)
\end{align}

\subsection{Rotational Inertia}
\label{sec:orgfa8f40f}
The right sum --- the mass times the distance away from maxis of rotation (\(\sum^N_{i=1} (m_i l_i^2)\)) --- is defined as the rotational (moment) of inertia (spinny mass). Hence:

\begin{equation}
    I = \sum^N_{i=1} (m_i l_i^2)
\end{equation}

But it's like not the same thing as \href{KBhPHYS360Impulse.org}{impulse}. The two \$I\$s does not relate to each other.

Intuitively, "inertia" is the resistance to movement. Moment of Inertia is the object's unwillingness to be rotated.

\subsection{The Many Properties of an Object}
\label{sec:orgdba0270}

\subsubsection{Properties}
\label{sec:orgb532bdd}
\begin{center}
\begin{tabular}{lll}
Property & Linear & Rotational\\
\hline
Inertia & \(M\) & \(I\)\\
Velocity & \(V\) & \(\omega\)\\
KE & \(\frac{1{2}Mv^2\) & \(\frac{1}{2}\omega^2\)\\
\end{tabular}
\end{center}

\subsubsection{Densities}
\label{sec:org04690c2}
\begin{center}
\begin{tabular}{lll}
Symbol & Density & Explanation\\
\hline
\(\rho\) (rho) & Volume density & \(\frac{kg}{m^3}\)\\
\(\sigma\) (sigma) & Area density & \(\frac{kg}{m^2}\)\\
\(\lambda\) (lambda) & Linear density & \(\frac{kg}{m}\)\\
\end{tabular}
\end{center}


\subsection{Moment of Inertia of a Flat Disk}
\label{sec:org2d3f6ee}
For a solid object, to calculate the rotational inertia will essentially be the sums of all rings.

\begin{equation}
    I = \int_0^d M(r)R^2 dr
\end{equation}

\begin{equation}
    max(m(a) = 2\pi r c \lambda
\end{equation}

Substituting that in.

\begin{equation}
I = \int_0^d 2\pi c \lambda r^3 dr
\end{equation}

Integrating it:

\begin{equation}
I = \frac{1}{2} \pi c \lambda r^4 \mid^d_0
\end{equation}

And then something happens that I am not entirely sure about:

\begin{equation}
    I = \frac{1}{2} M R^2
\end{equation}
\end{document}
